{
   

   
    "lifeinsurance": {
        "whatisit": {
            "headparagraph": "A contract is established between you and an insurance company which guarantees a specified amount of money will be paid to the beneficiary of your choice if you pass away.",
            "paragraphs": [
                "The death benefit is typically tax-free and bypasses probate<sup><a href='#fn1'>1<\/a><\/sup> - this means the funds will be available to your beneficiaries quickly.",
                "You and your loved ones will have peace of mind knowing that, if you pass away, your beneficiaries will receive a cheque and be able to use the funds however they feel would <em> best serve them.<\/em><sup><a href='#fn2'>2<\/a><\/sup>"
            ]
        },
        "whyisitimportant": {
            "headparagraph": "If you start your working career at age 25 and planned to work until 65 (40 years) making $25,000 per year, you would have made $1,000,000 in your lifetime.",
            "paragraphs": [
                "This simple example highlights one thing - your ability to generate income is a great asset that your dependents would have to make up for if you passed away unexpectedly.",
                "Purchasing life insurance is one way to ensure the people you care about have some form of financial protection in case something happens to you."
            ]
        },
        "sidebox": {
            "headline": "Things to keep in mind",
            "paragraphs": [
                "Permanent life insurance (sometimes called wholelife insurance or universal life insurance) is a category of insurance products that most people have heard of. This type of policy guarantees that something will be passed to your beneficiary regardless of your age when you pass away.",
                "These polices often include features that make them attractive, there may be potential for growth and funds in the policy typically can be accessed in the future. While they can be powerful tools when utilized in estate or succession planning, it is important to look at these policies as insurance products rather than investments.",
                "First and foremost, these policies are meant to protect your loved ones in the event of your death."
            ]
        }
    },

    "criticalillness": {
        "whatisit": {
            "headparagraph": "An insurer guarantees that you will receive a specified benefit (typically tax-free) should you be diagnosed with a covered condition and satisfy the survival period. <sup><a href='#fn1'>1</a><\/sup>",
            "paragraphs": [
                "Whether you use the funds to pay for treatment, take time off work or spend time with loved ones, critical illness insurance allows you to make decisions based on what is best for you at the time.",
                "Coverage is extended to 24 different conditions<sup><a href='#fn2'>2</a><\/sup> with partial benefits available for specified early intervention conditions."
            ]
        },
        "whyisitimportant": {
            "headparagraph": "Advances in modern medicine have allowed people to survive conditions that were fatal in the past. Unfortunately, recovering to the point of resuming daily life still takes time.",
            "paragraphs": [
                "Financial obligations don't pause during this process and patients are often forced to dip into their savings to make ends meet.",
                "This means that, after recovering, you may be forced to work longer than you previously expected to make up for the interruption in your financial plan."
            ]
        },
        "sidebox": {
            "headline": "Things to keep in mind",
            "paragraphs": [
                "Critical Illness contracts have very strict definitions in terms of what's covered and what needs to be satisfied to receive the benefit.",
                "The strict definitions mean that, if you satisfy the terms of the contract, the benefit is guaranteed to be paid out. However, it is possible that you are diagnosed with something that is not covered in the contract and thus would not receive a benefit.",
                "If you have questions about covered conditions or policy wording, make sure to ask to see a sample contract."
            ]
        }
    },

    "disability": {
        "whatisit": {
            "headparagraph": "If your ability to work is impacted by injury or illness, Disability Insurance will provide a monthly benefit until you have recovered and are able to resume your responsibilities. Some policies will pay you a benefit until you turn 65 if you remain disabled.",
            "paragraphs": [
                "While under the care of a physician, you will have to wait a period of time between the incident causing you to stop working and receiving benefits. After satisfying this elimination period<sup><a href='#fn1'>1<\/a><\/sup>, you will receive monthly benefits for as long as the benefit period<sup><a href='#fn2'>2</a><\/sup> you choose.",
                "Many disability contracts will provide partial benefits if you try to return to work but are unable to work full time or if your monthly income is still impacted by the injury or illness."
            ]
        },
        "whyisitimportant": {
            "headparagraph": "Being injured or ill is difficult on its own - not being able to work and bring in an income can make the situation feel overwhelming.",
            "paragraphs": [
                "Having a policy which guarantees you will receive an income each month while you are unable to work gives you peace of mind knowing that you and your loved ones will be able to maintain your lifestyle until you recover.",
                "While things like Workers Compensation<sup><a href='#fn3'>3<\/a><\/sup>, Employment Insurance<sup><a href='#fn4'>4<\/a><\/sup> and Canada Pension Plan<sup><a href='#fn5'>5<\/a><\/sup> can all provide assistance, qualifying for these programs is not guaranteed and the length of time you can receive benefits varies."
            ]
        },
        "sidebox": {
            "headline": "Things to know",
            "paragraphs": [
                "<strong>Maximum coverage<\/strong><\/br>",
                "Protecting all of your income with disability insurance is not possible (generally 80% of your income is the most that can be insured). The sources of your income must be provided via tax receipts or financial statements in order to be insured.",
                "<strong>Occupation classes<\/strong><\/br>",
                "Insurance companies classify each occupation with a ranking from 1 to 4 based on the type of work activities normally undertaken. Occupations with a higher chance of injury (based on previous claims experience) are given a lower rank and subsequently charged more for coverage."
            ]
        }
    },

    "longtermcare": {
        "whatisit": {
            "headparagraph": "A means of financial protection that becomes available if you are unable to care for yourself and require assistance with at least 2 of the 6 activities of daily living.<sup><a href='#fn1'>1</a><\/sup>",
            "paragraphs": [
                "After a waiting period, long term care contracts provide assistance in one of two ways; either you will receive a monthly benefit based on your coverage or you will be reimbursed for eligible expenses that are outlined in your plan.",
                "Whether you choose to move to a facility that provides the services you need or you hire help and make changes to your home - long term care plans allow you to choose the type of assistance you feel is best for your needs."
            ]
        },
        "whyisitimportant": {
            "headparagraph": "Being injured or ill is difficult on its own - not being able to work and bring in an income can make the situation feel overwhelming.",
            "paragraphs": [
                "Most people have faith in government programs and rely on them to be available if they need help. While there is protection afforded by the Canadian government, there is no guarantee that eligibility requirements will be met or that sufficient funds will be available when you need them.",
                "Having an independent contract with an insurer guarantees; how long you will wait before receiving benefits, how much you will be eligible to receive and how long you will receive benefits for.",
                "By removing the unknowns, you will be able to properly plan your retirement knowing that the help will be available if you need it."
            ]
        },
        "sidebox": {
            "headline": "Things to keep in mind",
            "paragraphs": [
                "Family and friends are often able to provide assistance if the need arises but some conditions may persist for long periods of time. While they may be happy to help, there is a certain amount of stress and anxiety involved in caring for a loved one. These informal caregivers are asked to make large sacrifices and likely lack the training or know-how to confidently provide the care needed."    
            ]
        } 
    },

    "thingstoknow": {
        "termorpermanent": {
            "html": "<h1 class=\u0022title is-4\u0022>Term and Permanent Insurance for Critical Illness and Life Insurance<\/h1><\/br><h2 class=\u0022subtitle\u0022>Term Insurance<\/h2><p>Term insurance is the most cost-effective type of insurance and should be used to protect against risks that have a foreseeable end date. After a certain age, term policies will expire and their protection will end. If the policy was never claimed, the premiums would have been spent to offset the insured risk.<\/p><p>Examples of short term risks include; insuring a mortgage or making sure your children are protected until they are of age. Both these risks will end at some point (ie. when you pay off the balance of your mortgage or your children are old enough to support themselves) and the protection will no longer be needed.<\/p><p>Term policies have a set price for a period of time (ie. 10, 20 or 30 years). After this first interval, the policy will automatically renew for a second interval at a higher price. You will not have to submit any paperwork or answer any medical questions when it renews. Renewals will continue until the policy expires when you reach a predetermined age.<\/p><\/br><h2 class=\u0022subtitle\u0022>Permanent Insurance<\/h2><p>Permanent insurance refers to products that stay in place until you claim them or you pass away. They have higher premiums than term insurance because they do not expire.<\/p><p>These policies generally need to be paid over a set period of time after which they are considered paid up and premiums are no longer owing. There are many features which can be added onto permanent policies which are not available for term products and, in some instances, there is the potential for growth within the policy.<\/p>"        
        },
        "agentsrole": {
            "html": "<h1 class='title is-4'>An Agent's Role<\/h1><\/br><h2 class='subtitle'>The importance of an agent<\/h2><p>The role of an insurance agent is to educate and provide advice so you can feel confident in the decision you make. Life insurance can be a confusing subject with a vast catalog of products all of which can sound attractive.<\/p><p>Advisors should provide you with a basic understanding of the 4 types of insurance and make recommendations relevant to your circumstance. They will be able to provide insight into the industry and will liaise between you and the insurance company.<\/p><p>If you feel like you are being pushed in one direction or another, stop and think whether the advice is sound or if it may be better to work with someone else. While an agent may have strong feelings about one thing or another - whatever you choose will impact you and your loved ones. The choice is always yours and you need to feel comfortable with whatever you decide.<\/p><\/br><h2 class='subtitle'>How are agents paid?<\/h2><p>An agent is paid a commission by the insurer based on the annual premium paid on a policy. The commission is included in the premiums which means that the price you pay will be the same whether you choose to work with one agent or another.</p><p>Generally, an agent will receive a larger commission the first year a policy is put in place with a much smaller trailer commission paid for subsequent years the policy remains in force. Agents may also receive non-monetary benefits such as conference credits for putting a certain number of policies in place.<\/p><p>If a policy is cancelled within two years of being put in place, an agent must refund some or all of the commission collected. This is to ensure that agent recommendations and advice never stem from the compensation or benefits they receive.<\/p><p>When choosing an insurance company for a policy, an agent should be making suggestions based on your needs. If there is a conflict of interest, it should be addressed by the agent.<\/p>"
        },
        "othercoverage": {
            "html": "<h1 class='title is-4'>Other Coverage<\/h1><\/br><h2 class='subtitle'>Group Insurance and Work Benefits<\/h2><p>Many employers and associations offer group insurance or benefits that may include some form of critical illness, disability or life insurance. While each plan is different, there is often a base amount of coverage with additional insurance available as an option.<\/p><p>The biggest difference between group coverage and having an independent contract is that you have no control over group coverage. If the group changes providers, decides to end the benefit or you change jobs, the coverage and its protection will end. <\/p><p>Understanding your group coverage is important when determining what forms of insurance may be applicable and how much is needed. If you can provide your advisor with your benefit plan, they should be able to give you an overview of your coverage.<\/p><\/br><h2 class='subtitle'>Mortgage Insurance<\/h2><p>Purchasing a home is a milestone that is as exciting as it is intimidating. It often includes taking on debt which should be properly protected against in case something unforeseen should happens. Banks offer their own mortgage protection insurance but the purpose of these products is to protect the bank's risk rather than protecting you and your loved one.<\/p><p>While these products will pay off the balance of your mortgage if something happens, there is little flexibility in how the funds can be used. Often, the premiums you pay will remain the same even though the covered amount decreases as you pay off the mortgage.<\/p><p>Most importantly, underwriting is done at time of claim rather than before you apply. This means that conditions may be found that invalidate the contract and stop the benefit from being paid.<\/p>"
        },
        "insurancecompanies": {
            "html": "  <h1 class='title is-4'>FAQ When Dealing with Insurance Companies<\/h1><\/br><h2 class='subtitle'>How are premiums calculated?<\/h2><p>The cost of insurance is calculated based on an insurer's risk in extending coverage to the insured. Factors such as being a smoker, age, current health and family history are all taken into consideration.<\/p><p>While higher risk individuals may have to pay more for coverage, healthier individuals may be offered better pricing because of the lower risk they pose.<\/p><p>If Person A is a smoker, that person is more likely to develop health complications than Person B who is not a smoker (all other things remaining equal). Because of this risk, Person A would have to pay higher premiums.<\/p><\/br><h2 class='subtitle'>The underwriting process<\/h2><p>The process of determining whether an insurance company will offer coverage to an individual is called underwriting. This includes questions about an individual's family history, personal medical history, lifestyle and current employment.<\/p><p>Depending on the amount of coverage and the answers to the questions above, insurance companies may ask for more detailed information. Medical underwriting such as urinalysis, blood profiles or attending physician's statements are common as insurers must determine their risk prior to making a decision.<\/p><\/br><h2 class='subtitle'>What is insurability?<\/h2><p>Whether or not a company is willing to extend coverage to an individual is called a person's insurability. Insurability is a snapshot of a person's current health and will change over time.<\/p><p>Putting a policy in place when an applicant is young and relatively healthy is important because that contract cannot be rescinded by an insurance company even if a person's health changes in the future.<\/p><p>As long as the policy premiums are paid and the questions in the application were answered honestly - that contract will remain in force.<\/p>"
        }
    },

    
    "about": {
        "whoarewe": {
            "html": "<h1 class='title'>Who are we?<\/h1><\/br><p>To be perfectly honest – it’s actually just me (my name’s Justin). I’m glad you found your way to this site and hopefully you gain something from your time here.<\/p><\/br><p>I’ve had my life insurance license since 2013 and it always frustrated me how dense and difficult to understand everything related to life insurance is. This site is my attempt to help people understand the basics of life insurance so they can figure out their own needs.<\/p><p>I’ve had my life insurance license since 2013 and it always frustrated me how dense and difficult to understand everything related to life insurance is. This site is my attempt to help people understand the basics of life insurance so they can figure out their own needs.<\/p><p>I know that the insurance industry has a stigma attached to it – I’ve dealt with that preconception ever since I got my license. I sincerely believe that life insurance products can help and the protection they afford can be extremely valuable when needed. <\/p><p>My advice would be to try your best to understand the basics and remember that, whether it’s for yourself or your loved ones, the purpose of insurance should always be protection.<\/p>"
        },
        "ourpurpose": {
            "html": "<h1 class='title'>Our Purpose<\/h1><\/br><h2 class='subtitle'>This website is meant to explain the principles of life insurance in a simplified and understandable way. The hope is to give users the knowledge necessary to make an informed decision about their needs and whether insurance should be considered.<\/h2><\/br><p>There were three assumptions made when creating this website:<\/p><ol><li> Life insurance can help - it can make a difference for individuals, families and friends during difficult times.<\/li><li> Each person should decide for themselves - but they need to understand the basics before an informed decision can be made.<\/li><li> Form does not matter - if there is a need, the structure of the solution is not important.<\/li><\/ol><\/br><p>The importance of working with a good advisor cannot be understated, they will provide insight into the industry and help you find the best fit. Find someone who spends the time to understand your situation before recommending solutions and educate yourself so are confident in the solutions being implemented.<\/p>"
        }
    }
}
    
    