{
   

   
    "lifeinsurance": {
        "whatisit": {
            "headparagraph": "A contract is established between you and an insurance company which guarantees a specified amount of money will be paid to the beneficiary (or beneficiaries) of your choice if you pass away.",
            "paragraphs": [
                "The death benefit is typically tax-free and bypasses probate - this means the funds will be available to your beneficiaries quickly.",
                "You and your loved ones will have peace of mind knowing that, if you pass away, your beneficiaries will receive a cheque and be able to use the funds however they feel would <em> best serve them.<\/em>"
            ]
        },
        "whyisitimportant": {
            "headparagraph": "If you start your working career at age 25 and planned to work until 65 (40 years) making $25,000 per year, you would have made $1,000,000 in your lifetime.",
            "paragraphs": [
                "This highly simplified example highlights one thing - your ability to generate income is a great asset and, if you were to pass away unexpectedly, your dependents would have to find alternative sources to make up for the loss of your income.",
                "Purchasing life insurance is one way to ensure the people you care about have some form of protection in case something happens to you."
            ]
        },
        "thingstokeepinmind": {
            "headparagraph": "Mortgage Insurance vs Life Insurance: <br\/> People typically start to think about life insurance when they are about to take on debt. Purchasing a place to live and insuring a mortgage is a common reason for learning more about life insurance.",
            "paragraphs": [
                "Mortgage insurance is a product that most lenders offer and it means that, if you pass away, the remaining balance on your mortgage is paid off. While this may sound the same, this is very different from Life Insurance. Most importantly, your beneficiaries have no control over what to do with the funds."
            ]
        },
        "sidebox": {
            "headline": "Permanent Life Insurance",
            "paragraphs": [
                "Permanent Life Insurance (also known as Wholelife Insurance or Universal Life Insurance) is a product that often includes features that make it attractive. It has the potential to grow and money put into the policy can often be accessed in the future.",
                "First and foremost, these products are meant to protect those left behind in the event of your death. While they can be a powerful tool when utilized in estate/succession planning it is important to look at these policies as insurance products rather than investments.",
                "Features may include:",
                "Cash Surrender Value - premiums paid into the policy can be accessed either by surrendering the policy (less recommended because of taxation) or taking a loan on the policy.",
                "Limited Pay - payments are paid over a specified period of time after which the policy is considered paid up.",
                "Growth - the death benefit can increase over time based on the Insurer's rate of return."
            ]
        }
    },

    "about": {
        "ourpurpose": {
            
        }
    }
}
    
    